app/Controllers/Admin.php

    public function index()
    {
        // Instanciamos el modelo ("llamamos al portero")
        $usuarioModel = new UsuarioModel();

        // Le pedimos TODOS los usuarios con findAll()
        // Esto equivale a un "SELECT * FROM usuarios"
        $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `usuarios`