app/Controllers/Admin.php

    public function usuarios()
    {
        // Instancio el Modelo
        $usuarioModel = new UsuarioModel();

        // 1. Capturo el dato 'rol' de la URL
        $filtroRol = $this->request->getGet('rol');

        // 2. Si tengo un rol seleccionado, aplico el filtro
        if ($filtroRol) {
            $usuarioModel->where('id_rol', $filtroRol);
        }

        // 3. Obtengo los usuarios (filtrados o todos)
        $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `usuarios`

    public function datosGrafica()
    {
        // Se conecta a la bd y accede a la tabla de las clases
        $db = \Config\Database::connect();
        $builder = $db->table('clases');

        // Seleccionamos el nombre de la clase y contamos el total de personas que se han apuntado
        $builder->select('clases.nombre, COUNT(reservas.id) as total');

        // Hacemos un JOIN para juntar las 2 tablas, ponemos el LEFT para que aunque hayan 0 reservas se muestren igualmente
        $builder->join('reservas', 'reservas.id_clase = clases.id', 'left');
        $builder->groupBy('clases.id');

        // Obtenemos los datos y los enviamos como JSON
        $data = $builder->get()->getResultArray();
---
SELECT `clases`.`nombre`, COUNT(reservas.id) as total
FROM `clases`
LEFT JOIN `reservas` ON `reservas`.`id_clase` = `clases`.`id`
GROUP BY `clases`.`id`