app/Controllers/Clases.php

    public function index()
    {
        // Instanciamos el modelo
        $clasesModel = new ClasesModel();

        // 1. Cargamos el modelo de Usuarios para llenar el desplegable
        $usuarioModel = new \App\Models\UsuarioModel();
        $data['entrenadores'] = $usuarioModel->where('id_rol', 2)->findAll();

        // 2. Capturamos el filtro de la URL usando el GET
        $filtroEntrenador = $this->request->getGet('entrenador_id');

        // 3. Construimos la consulta para poder filtrar
        // Seleccionamos los datos de la clase y los nombres del entrenador
        $clasesModel->select('clases.*, usuarios.nombre as nombre_entrenador, usuarios.apellidos as apellidos_entrenador')
                    ->join('usuarios', 'usuarios.id = clases.id_entrenador');

        // 4. Si hay filtro seleccionado, lo aplicamos
        if ($filtroEntrenador) {
            $clasesModel->where('clases.id_entrenador', $filtroEntrenador);
        }

        // 5. Ejecutar la consulta
        $data['clases'] = $clasesModel->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id_rol` = 2
SELECT `clases`.*, `usuarios`.`nombre` as `nombre_entrenador`, `usuarios`.`apellidos` as `apellidos_entrenador`
FROM `clases`
JOIN `usuarios` ON `usuarios`.`id` = `clases`.`id_entrenador`

    public function crear()
    {
        // 1. Llamamos al modelo de Usuarios
        $usuarioModel = new \App\Models\UsuarioModel();

        // 2. Buscamos SOLO a los entrenadores
        $data['entrenadores'] = $usuarioModel->where('id_rol', 2)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id_rol` = 2