app/Controllers/Clases.php

    public function guardar()
    {
        // 1. Instanciamos el modelo
        $clasesModel = new ClasesModel();

        // 2. Creamos el paquete de datos (Array)
        // OJO: Las palabras a la izquierda deben coincidir EXACTAMENTE con tu base de datos
        $datos = [
            'nombre'         => $this->request->getPost('nombre'),
            'descripcion'    => $this->request->getPost('descripcion'),
            'fecha_hora'     => $this->request->getPost('fecha_hora'),
            'plazas_totales' => $this->request->getPost('plazas_totales'),
            'id_entrenador'  => $this->request->getPost('id_entrenador'),
        ];

        // 3. Guardamos
        $clasesModel->save($datos);
---
INSERT INTO `clases` (`nombre`, `descripcion`, `fecha_hora`, `plazas_totales`, `id_entrenador`) VALUES ('Yoga', 'Clase de relagacion y chillleo', '2026-02-18T15:32', '30', '2')