app/Controllers/Horarios.php

    public function index()
    {
        // Iniciamos la sesion
        $session = session();

        // Seguridad
        // Si no estamos logeado nos manda al login
        if (!$session->get('is_logged_in')) {
            return redirect()->to('/login');
        }

        // Si intenta apuntarse una persona que no es socio muestra un mensaje de error
        if ($session->get('id_rol') == 3) {
            return redirect()->to('/')->with('mensaje_error', 'Debes ser Socio para reservar clases.');
        }

        // Cargar modelos
        $clasesModel = new \App\Models\ClasesModel();
        $reservasModel = new \App\Models\ReservasModel();

        // Obtenemos las clases
        $clases = $clasesModel->select('clases.*, usuarios.nombre as nombre_entrenador')
            ->join('usuarios', 'usuarios.id = clases.id_entrenador')
            ->orderBy('fecha_hora', 'ASC')
            ->findAll();

        // Calculamos las plaza libres
        // Recorremos cada clase para calcular cuántas plazas quedan
        foreach ($clases as &$clase) {
            // Contamos cuántas reservas tiene esta clase específica
            $numReservas = $reservasModel->where('id_clase', $clase['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reservas`
WHERE `id_clase` = '7'