app/Controllers/Horarios.php

SELECT `clases`.*, `usuarios`.`nombre` as `nombre_entrenador`
FROM `clases`
JOIN `usuarios` ON `usuarios`.`id` = `clases`.`id_entrenador`
ORDER BY `fecha_hora` ASC
SELECT `id_clase`
FROM `reservas`
WHERE `id_usuario` = '1'
---
    public function index()
    {
        $session = session();

        // 1. Seguridad
        if (!$session->get('is_logged_in')) {
            return redirect()->to('/login');
        }
        if ($session->get('id_rol') == 3) {
            return redirect()->to('/')->with('mensaje_error', 'Debes ser Socio para reservar clases.');
        }

        // 2. Cargar modelos
        $clasesModel = new \App\Models\ClasesModel();
        $reservasModel = new \App\Models\ReservasModel();

        // 3. OBTENER CLASES + NOMBRE DEL ENTRENADOR (JOIN) 👇
        $data['clases'] = $clasesModel->select('clases.*, usuarios.nombre as nombre_entrenador')
            ->join('usuarios', 'usuarios.id = clases.id_entrenador')
            ->orderBy('fecha_hora', 'ASC')
            ->findAll();

        // 4. Obtener reservas del usuario actual (para los botones)
        $idUsuario = $session->get('id');
        $misReservas = $reservasModel->where('id_usuario', $idUsuario)->findColumn('id_clase');

SELECT *
FROM `clases`
WHERE `clases`.`id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `reservas`
WHERE `id_clase` = '2'
INSERT INTO `reservas` (`id_usuario`, `id_clase`) VALUES ('1', '2')
---
    public function reservar()
    {
        // 1. Recogemos datos
        $idClase = $this->request->getPost('id_clase');
        $idUsuario = session()->get('id');

        // 2. Seguridad: Si no hay usuario que mos saque a fuera
        if (!$idUsuario) {
            return redirect()->to('/login')->with('mensaje_error', 'Debes iniciar sesión para reservar.');
        }

        // 3. Cargamos modelos
        $clasesModel = new \App\Models\ClasesModel();
        $reservasModel = new \App\Models\ReservasModel();

        // 4. Datos de la clase y contar cuantos van
        $clase = $clasesModel->find($idClase);
        $numReservas = $reservasModel->where('id_clase', $idClase)->countAllResults();

        // 5. Comprobamos aforo
        if ($numReservas < $clase['plazas_totales']) {
            // A) Hay sitio: Guardamos
            $datosReserva = [
                'id_usuario' => $idUsuario,
                'id_clase'   => $idClase
            ];
            $reservasModel->insert($datosReserva);