app/Controllers/Productos.php

SELECT `productos`.*, `categorias`.`nombre_categoria`
FROM `productos`
JOIN `categorias` ON `categorias`.`id` = `productos`.`id_categoria`
---
    public function index()
    {
        $productosModel = new ProductosModel();

        // Traemos productos + nombre de categoría
        $data['productos'] = $productosModel->select('productos.*, categorias.nombre_categoria')
                                            ->join('categorias', 'categorias.id = productos.id_categoria')
                                            ->findAll();