app/Controllers/Tienda.php

SELECT *
FROM `productos`
---
    public function index()
    {
        // 1. Iniciamos sesión (aunque sea pública, la vista necesita saber si el usuario está logueado para mostrar el botón de compra)
        $session = session();

        // 2. Instanciamos el modelo
        $productosModel = new ProductosModel();

        // 3. Obtenemos TODOS los productos
        // findAll() hace un "SELECT * FROM productos"
        $data['productos'] = $productosModel->findAll();