app/Controllers/Tienda.php

SELECT *
FROM `productos`
ORDER BY `id` ASC
 LIMIT 42, 6
SELECT COUNT(*) AS `numrows`
FROM `productos`
---
        }

        // EJECUTAMOS LA CONSULTA
        $data['productos'] = $productosModel->paginate(6);